/************************************************
*编写一个程序，从键盘上键入5个double类型的值，*
*将它们存储到一个数组中。                      *
*计算每个值的倒数，将结果存储到另一个数组中。 *
*输出这些倒数（保留2位小数），                 *
*并计算和输出倒数的总和（保留6位小数）。      *
*************************************************/

#include <stdio.h>
#include <stdlib.h>

int main()
{
    int i; double a[5];
    for (i=0; i<5; i++){
        scanf("%lf",&a[i]);
    }
    double b[5];
    for (i=0; i<5; i++){
        b[i] = 1.0/a[i];
        printf("%.2lf",b[i]);
        if (i<4) printf(" ");
    }
    printf("\n%.6lf",b[0]+b[1]+b[2]+b[3]+b[4]);
    return 0;
}
