#include <stdio.h>
#include <stdlib.h>

int main()
{
    int a1,b1,c1,a2,b2,c2,m1=0;
    scanf("%d %d %d %d %d %d",&a1,&b1,&c1,&a2,&b2,&c2);
    const int n1=a2-a1,n2=b2,n3=a1,n4=a2,n5=b1;//n1为固定年份差n2为初始结束月份n3为初始开始年份n4为初始结束年份n5为初始开始月份
    if(b2<b1||(b2==b1&&c2<c1))//当时间差不足一年时
    {for (int i=0;i<(n1-1);++i)//n1为固定年份差
        {if((a1%4==0&&a1%100!=0)||(a1%100==0&&a1%400==0))
            m1=m1+366;
        else
            m1=m1+365;
        ++a1;
        }//以上为计算年份天数
     if(b1>b2)
        {for(int i=0;i<(11-b1+n2);++i)//n2为初始结束月份
          {
              ++b2;
              if(b2>=13)
                {b2=1;
                m1=m1+31;}
              else
              {if(b2==3||b2==5||b2==7||b2==8||b2==10||b2==12)
                m1=m1+31;
              else if(b2==2&&((n4%4==0&&n4%100!=0)||(n4%100==0&&n4%400==0)))//n4为初始结束年份
                m1=m1+29;
              else if(b2==4||b2==6||b2==9||b2==11)
                m1=m1+30;
              else
                m1=m1+28;
              }
          }
          //以上为计算月份天数
          m1=m1+c2;
          if(n2==1||n2==3||n2==5||n2==7||n2==8||n2==10||n2==12)//n2为初始结束月份
                m1=m1+(31-c1);
          else if(n2==2&&((n3%4==0&&n3%100!=0)||(n3%100==0&&n3%400==0)))//n3为初始开始年份
                m1=m1+(29-c1);
          else if(n2==4||n2==6||n2==9||n2==11)
                m1=m1+(30-c1);
          else
                m1=m1+(28-c1);//以上为计算日天数
        }
     else
            {if((a1%4==0&&a1%100!=0)||(a1%100==0&&a1%400==0))
            m1=m1+366-(c1-c2);
            else
            m1=m1+365-(c1-c2);
            }//当月份相同时的简便算法
    }
    else//当时间差超过一年时
    {for (int i=0;i<n1;++i)//n1为固定年份差
        {if((a2%4==0&&a2%100!=0)||(a2%100==0&&a2%400==0))
            m1=m1+366;
        else
            m1=m1+365;
        ++a2;
        }//以上为计算年份天数
    if(c2<c1)
     {for(int i=0;i<(b2-n5-1);++i)//n5为初始开始月份
          {
              ++b1;
              if(b1==1||b1==3||b1==5||b1==7||b1==8||b1==10||b1==12)
                m1=m1+31;
              else if(b1==2&&((n3%4==0&&n3%100!=0)||(n3%100==0&&n3%400==0)))//n3为初始开始年份
                m1=m1+29;
              else if(b1==4||b1==6||b1==9||b1==11)
                m1=m1+30;
              else
                m1=m1+28;
          }//以上为计算月份天数
          m1=m1+c2;
          if(n2==1||n2==3||n2==5||n2==7||n2==8||n2==10||n2==12)//n2为初始结束月份
                m1=m1+(31-c1);
          else if(n2==2&&((n3%4==0&&n3%100!=0)||(n3%100==0&&n3%400==0)))//n3为初始开始年份
                m1=m1+(29-c1);
          else if(n2==4||n2==6||n2==9||n2==11)
                m1=m1+(30-c1);
          else
                m1=m1+(28-c1);//以上为计算日天数
     }
     else
        {for(int i=0;i<(b2-n5);++i)//n5为初始开始月份
          {
              if(b1==1||b1==3||b1==5||b1==7||b1==8||b1==10||b1==12)
                m1=m1+31;
              else if(b1==2&&((n3%4==0&&n3%100!=0)||(n3%100==0&&n3%400==0)))//n3为初始开始年份
                m1=m1+29;
              else if(b1==4||b1==6||b1==9||b1==11)
                m1=m1+30;
              else
                m1=m1+28;
              ++b1;
          }//以上为计算月份天数
          m1=m1+c2-c1;//以上为计算日天数
    }
    }
    printf("采集时间为%d天",m1);
}
