#include <stdio.h>
#include <stdlib.h>

int main()
{
    int y1=0,m1=0,d1=0;
    int y2=0,m2=0,d2=0;
    int sum1=0;
    int sum=0,sum2=0;
    int year1=366;
    int year2=365;
    int day1=31;
    int day2=30;
    int day3=29;
    scanf("%d %d %d %d %d %d",&y1,&m1,&d1,&y2,&m2,&d2);
    //如果是隔着完整的一年，比如说2011到2014，算出夹在中间的完整的两年
    for( ; y1+1<y2; y1++)
    {
        if(((y1+1)%4==0)&&((y1+1)%100!=0)||((y1+1)%400==0))
            sum+=year1;
        else
            sum+=year2;
    }
    //比如还是2011的六月到2014，算出2011六月到最后总共还有多少天才到七月
    if(m1==1||m1==3||m1==5||m1==7||m1==8||m1==10||m1==12)
        sum1+=day1-d1;
    else if(m1==4||m1==6||m1==9||m1==11)
        sum1+=day2-d1;
    else if(m1==2)
    {
        if(((y1+1)%4==0)&&((y1+1)%100!=0)||((y1+1)%400==0))
            sum1+=day3-d1;
        else
            sum1+=day3-1-d1;
    }



//如果两年分不相同，算出2011年六月之后的七月到2011年底，总共还有多少天。
    if((y1)!=(y2))
    {
        for( ; m1+1<=12; m1++)
        {
            if(m1+1==1||m1+1==3||m1+1==5||m1+1==7||m1+1==8||m1+1==10||m1+1==12)
                sum+=day1;
            if(m1+1==4||m1+1==6||m1+1==9||m1+1==11)
                sum+=day2;
            if(m1+1==2)
            {
                if(((y1)%4==0)&&((y1)%100!=0)||((y1)%400==0))
                    sum+=day3;
                else
                    sum+=day3-1;
            }
        }
        //同样的，算出2014年初到2014年的那个日期前的一个月总共有多少天
        for( ; m2-1>0; m2--)
        {
            if(m2-1==1||m2-1==3||m2-1==5||m2-1==7||m2-1==8||m2-1==10||m2-1==12)
                sum+=day1;
            if(m2-1==4||m2-1==6||m2-1==9||m2-1==11)
                sum+=day2;
            if(m2-1==2)
            {
                if(((y2)%4==0)&&((y2)%100!=0)||((y2)%400==0))
                    sum+=day3;
                else
                    sum+=day3-1;
            }
        }
        //再把2011年的六月剩余的天数，2011年7月到年底的天数，2012，2013整年的天数，2014年年初到那个月之前前一个月的天数和那个月已经过了的天数加起来
        printf("采集时间为%d天",sum+sum1+d2);
    }
    //同样的思路，年份相同时，算月份之间夹着多少整月，以及当前月份还没过完的天数，和目的月份已经过的天数
    if((y1)==(y2))
    {
        if(m1!=m2)
    {
        for( ; m1+1<m2; m1++)
        {
            if(m2-1==1||m2-1==3||m2-1==5||m2-1==7||m2-1==8||m2-1==10||m2-1==12)
                sum2+=day1;
            if(m2-1==4||m2-1==6||m2-1==9||m2-1==11)
                sum2+=day2;
            if(m2-1==2)
            {
                if(((y2)%4==0)&&((y2)%100!=0)||((y2)%400==0))
                    sum2+=day3;
                else
                    sum2+=day3-1;
            }
        }
        printf("采集时间为%d天",sum1+d2+sum2);
    }
    else
        printf("采集时间为%d天",d2-d1);
    }
}
